#+title:  Chapter 9
#+author: Reinhard Stahn
#+setupfile: ./inc/setupfile.org
#+include: ./inc/latex-macros.org
#+property: header-args:sage :session *sage-chapter-9* :tangle chapter_9.sage

#+toc: headlines 2

*** Solution
For the commuting pair of density operators we have

$$
  D_1 = \frac{1}{2} \left(\abs{\frac{3}{4}-\frac{2}{3}} + \abs{\frac{1}{4}-\frac{1}{3}}\right)
  = \frac{1}{12} .
$$

Let us consider the second, more interesting example. To compute $D_2=D(\rho,\sigma)$ we
could compute the eigenvalues $\lambda_i$ of $\rho-\sigma$. We then have
$D_2=(\abs{\lambda_1}+\abs{\lambda_2})/2$.

#+begin_src sage :results replace :tangle no
  plus = matrix((ket('0') + ket('1'))/sqrt(2))
  minus = matrix((ket('0') - ket('1'))/sqrt(2))

  rho = matrix([[3/4, 0], [0, 1/4]])
  sigma = (2/3)*plus.H*plus + (1/3)*minus.H*minus

  # To compute the distance we essentially have to compute the eigenvalues of rho - sigma
  # (and add their absolute values).
  A = rho - sigma
  assert A.eigenvalues() == [-1/12*sqrt(13), 1/12*sqrt(13)]

  # Just for fun: In this special case you can extract the relevant information from the
  # A.H*A since this one is already diagonal.
  A2 = A.H * A
  assert A2 == (13/144) * matrix.diagonal([1, 1])
  "PASSED"
#+end_src

#+RESULTS:
: 'PASSED'

Hence

$$
  D_2 = \frac{\sqrt{13}}{12} .
$$

